[
  {
    "title":"Aviation Boatswain's Mate",
    "branch":"Navy",
    "abbreviation":"AB",
    "type":"Aviation",
    "description":"Aviation Boatswain's Mates are responsible for aircraft catapults, arresting gear and barricades. They operate fuel and lube oil transfer systems, as well as direct aircraft on the flight deck and in hangar bays before launch and after recovery. They use tow tractors to position planes and operate support equipment used to start aircraft."
  },
  {
    "title":"Air-Traffic Controller",
    "branch":"Navy",
    "abbreviation":"AC",
    "type":"Aviation",
    "description":"Air-Traffic Controllers assist with the speedy flow of air traffic by directing and controlling aircraft. They operate field lighting systems and communicate with aircraft. They furnish pilots with information regarding traffic, navigation and weather conditions, as well as operate and adjust ground-controlled approach (GCA) systems and interpret targets on radar screens and plot aircraft positions."
  },
  {
    "title":"Aviation Machinist's Mate",
    "branch":"Navy",
    "abbreviation":"AD",
    "type":"Aviation",
    "description":"Aviation Machinist's Mates are usually assigned to billets concerned with the maintenance of turbo-jet aircraft engines and associated equipment. They are responsible for the maintenance and replacement of aircraft engines and accessories, as well as performing the duties of flight engineers."
  },
  {
    "title":"Aviation Electrician's Mate",
    "branch":"Navy",
    "abbreviation":"AE",
    "type":"Aviation",
    "description":"Aviation Electrician's Mates are responsible for aircraft electrical power generating and converting systems. They maintain lighting, control, and indicating systems and can install as well as maintain flight and engine instrument systems."
  },
  {
    "title":"Aerographer's Mate",
    "branch":"Navy",
    "abbreviation":"AG",
    "type":"Aviation",
    "description":"Aerographer's Mates are the U.S. Navy's weather forecasters. They are trained in meteorology and the use of aerological instruments that monitor air pressure, temperature, humidity, wind speed, and direction. They prepare weather maps and forecasts and can analyze atmospheric conditions to determine the best flight levels for aircraft. An AG can measure wind and air density to aid the accuracy of anti-aircraft firing, shore bombardment and delivery of weapons by aircraft."
  },
  {
    "title":"Aviation Structural Mechanic",
    "branch":"Navy",
    "abbreviation":"AM",
    "type":"Aviation",
    "description":"Aviation Structural Mechanics are responsible for the maintenance of many aircraft parts such as wings, fuselage, tail, control surfaces, landing gear, and hydraulic systems. AME's maintain and repair oxygen, cockpit and cabin pressurization, and ejection seat systems."
  },
  {
    "title":"Aviation Ordnanceman",
    "branch":"Navy",
    "abbreviation":"AO",
    "type":"Aviation",
    "description":"Aviation Ordnancemen operate and handle aviation ordnance equipment. They are responsible for the maintenance of guns, bombs, torpedoes, rockets, and missiles. Their duties include the stowing, issuing, and loading of munitions and small arms."
  },
  {
    "title":"Aviation Support Equipment Technician",
    "branch":"Navy",
    "abbreviation":"AS",
    "type":"Aviation",
    "description":"Aviation Support Equipment Technicians perform intermediate maintenance on aviation accessory equipment at naval air stations and aboard aircraft carriers. They maintain gasoline and diesel engines, gas turbine compressor units and electrical systems."
  },
  {
    "title":"Aviation Electronics Technician",
    "branch":"Navy",
    "abbreviation":"AT",
    "type":"Aviation",
    "description":"Aviation Electronics Technicians are responsible for the maintenance of all aircraft radio, radar, and other rapid communications devices. They maintain all navigation equipment, and calibration of aviation and shipboard systems alike."
  },
  {
    "title":"Naval Aircrewman",
    "branch":"Navy",
    "abbreviation":"AW",
    "type":"Aviation",
    "description":"Naval Aircrewman operate airborne radar and electronic equipment used in detecting, locating, and tracking submarines. They provide information for aircraft and surface navigation and act as helicopter-rescue crewmen, and function as part of the flight crew on long-range and intermediate-range aircraft. Beginning in 2009, other enlisted Aviation ratings that perform flight engineer or loadmaster duties in Navy aircraft will convert to the AW rating."
  },
  {
    "title":"Aviation Maintenance Administrationman",
    "branch":"Navy",
    "abbreviation":"AZ",
    "type":"Aviation",
    "description":"Aviation Maintenance Administration men perform clerical, administrative, and managerial duties necessary to keep aircraft maintenance activities running smoothly. They schedule and coordinate the maintenance workload, including inspections and modifications to aircraft and equipment."
  },
  {
    "title":"Aircrew Survival Equipmentman",
    "branch":"Navy",
    "abbreviation":"PR",
    "type":"Aviation",
    "description":"Aircrew Survival Equipmentmen are responsible for the packing and care of parachutes. They maintain flight clothing, rubber life rafts, life jackets, oxygen-breathing apparatus, protective clothing, and air-sea rescue equipment. The abbreviation comes from the former official title (still used informally) of parachute rigger."
  },
  {
    "title":"Builder",
    "branch":"Navy",
    "abbreviation":"BU",
    "type":"Construction",
    "description":"Navy builders are like civilian construction workers. They are skilled carpenters, plasterers, roofers, cement finishers, asphalt workers, masons, and painters. They build and repair all types of structures including: piers, bridges, towers, schools, offices, houses, and other buildings."
  },
  {
    "title":"Construction Electrician",
    "branch":"Navy",
    "abbreviation":"CE",
    "type":"Construction",
    "description":"Construction Electricians are responsible for the power production and electrical work required to build and operate airfields, roads, barracks, and hospitals. The work of a CE is equivalent to civilian construction electricians, telephone and electrical repairmen, lineman, and others."
  },
  {
    "title":"Construction Mechanic",
    "branch":"Navy",
    "abbreviation":"CM",
    "type":"Construction",
    "description":"Construction Mechanics maintain many types of construction machinery including; buses, dump trucks, bulldozers, rollers, cranes, backhoes, and pile drivers. They work on gasoline and diesel engines and transmissions. They also repair electrical, hydraulic, pneumatic and steering systems."
  },
  {
    "title":"Engineering Aide",
    "branch":"Navy",
    "abbreviation":"EA",
    "type":"Construction",
    "description":"Engineering Aides provide construction engineers with information needed to develop final construction plans. They conduct surveys for roads, airfields, buildings, etc. They perform soil tests, prepare topographic and hydrographic maps. They also survey for sewers, water lines, drainage systems and underwater excavations."
  },
  {
    "title":"Equipment Operator",
    "branch":"Navy",
    "abbreviation":"EO",
    "type":"Construction",
    "description":"Equipment Operators work with heavy machinery such as bulldozers, power shovels, pile drivers, etc. They use this machinery to dig ditches, excavate for building foundations, break up old concrete or asphalt paving and pour new paving. They grade and remove debris from construction sites, raise girders, and move and set in place other pieces of equipment or materials needed for the job."
  },
  {
    "title":"Steelworker",
    "branch":"Navy",
    "abbreviation":"SW",
    "type":"Construction",
    "description":"Steelworkers rig and operate all special equipment used to move or hoist structural steel, structural shapes and similar material. They erect and dismantle steel bridges, piers, buildings, storage tanks, etc. They work with steel shapes, plates and built-up sections used in the construction of overseas facilities. They are skilled in arc welding, MIG welding, TIG welding, and gas welding."
  },
  {
    "title":"Utilitiesman",
    "branch":"Navy",
    "abbreviation":"UT",
    "type":"Construction",
    "description":"Utilitiesmen supervise and perform tasks involved in the installation and maintenance of plumbing, steam, compressed air and fuel storage and distribution systems. They maintain air conditioning and refrigeration equipment, as well as sewage collecting and disposal facilities."
  },
  {
    "title":"Hospital Corpsman",
    "branch":"Navy",
    "abbreviation":"HM",
    "type":"Medical",
    "description":"Hospital Corpsmen are medical professionals who provide health care to service people and their families. They serve as pharmacy technicians, medical technicians, nurse's aides, physician's or dentist's assistants, battlefield medics, and more. All work falls into several categories: first aid and minor surgery, patient transportation, patient care, prescriptions and laboratory work, food service inspections, and clerical duties."
  },
  {
    "title":"Boatswain's Mate",
    "branch":"Navy",
    "abbreviation":"BM",
    "type":"Other",
    "description":"Boatswain's Mates train and supervise personnel in all activities relating to marlinspike, deck, and boat seamanship, and oversee the maintenance of the ship's external structure and deck equipment. They act as petty officers in charge of small craft and may perform duties as master-at-arms, serve in or take charge of gun crews, and damage control parties.\n\nBoatswain's Mates are also responsible for the \"deck side\" watch. In port three of the crew are on deck watch 24/7 (in hazardous areas such as war zones there are more than three, depending on ship's size). They are the Officer of the Deck, Boatswain's Mate of the watch, and Messenger of the Watch (usually a Seaman or Seaman Apprentice). They are stationed very close to the gangway and monitor all the comings and goings of persons to and from the ship. At sea the Boatswain's Mate of the watch is within ear shot of the conning officer (on the bridge). The boatswain's Mate of the watch supervises the rest of the enlisted watch standers on deck. They include helmsman, messenger of the watch, and all the look outs. In port or at sea the Boatswain's Mate of the watch is charged with the responsibility of making all announcements to the crew; everything from chow call to general quarters (battle stations)."
  },
  {
    "title":"Culinary Specialist",
    "branch":"Navy",
    "abbreviation":"CS",
    "type":"Other",
    "description":"Culinary Specialists prepare menus and order the quantities and types of food items. They operate galley and dining facilities, manage large facilities, keep records for food supplies and financial budgets, and can even serve as flight attendant aircrewmen. They can also serve as personal food service specialist, household/estate manager or chef for an admiral, the First Family, President of the United States at Camp David and the White House, to the Vice President at Number One Observatory Circle or for a commanding officer aboard ship or at shore bases. Ashore, Culinary Specialists often manage and maintain clubs, TAD hotels and Permanent Party naval barracks."
  },
  {
    "title":"Cryptologic Technician",
    "branch":"Navy",
    "abbreviation":"CT",
    "type":"Other",
    "description":"Cryptologic Technicians control the flow of messages and information and also conduct Electronic Warfare. Their work depends on their special branch: CTAs or Administration Cryptologic Technicians (As of 01 OCT 07 CTA merged with the YN rating) perform administrative and clerical duties that control access to classified material. CTIs or Interpretive Cryptologic Technicians handle radiotelephone communications and foreign language translation. CTMs or Maintenance Cryptologic Technicians maintain electronic and electromechanical equipment. CTNs or Networking Cryptologic Technicians handle computer communication. CTRs or Collection Cryptologic Technicians handle all Morse code communications and operate radio direction-finding equipment. Finally, CTTs or Technical Cryptologic Technicians deal with Electronic Warfare. CTTs are the first line of defense against inbound threats and Anti-Ship missiles. They also collect, analyze, and provide electronic intelligence support to commands throughout the world."
  },
  {
    "title":"Explosive Ordnance Disposal",
    "branch":"Navy",
    "abbreviation":"EOD",
    "type":"Other",
    "description":"Explosive Ordnance Disposal Technicians locate, identify, render safe and dispose of all forms of ordnance (conventional, nuclear, chemical, biological, military, and improvised) both U.S. and foreign made. Parachute or Helicopter insertion and deep-sea diving capabilities are sometimes necessary to perform this mission. In addition to working closely with other military services, EOD technicians occasionally assist civilian law enforcement agencies."
  },
  {
    "title":"Electronics Technician",
    "branch":"Navy",
    "abbreviation":"ET",
    "type":"Other",
    "description":"Electronics Technicians are responsible for electronic equipment used to send and receive messages, detect enemy planes and ships, and determine target distances. They maintain, repair, and calibrate all electronic equipment used for communications, detection tracking, identification, and navigation. Specially qualified Electronics Technicians are employed onboard nuclear-powered ships to operate the nuclear reactor and maintain its control subsystems."
  },
  {
    "title":"Fire Controlman",
    "branch":"Navy",
    "abbreviation":"FC",
    "type":"Other",
    "description":"Fire Controlmen maintain the control mechanism used in weapons systems on combat ships. Complex electronic, electrical and hydraulic equipment is required to ensure the accuracy of Navy guided-missile and surface gunfire-control systems. They are responsible for the operation, routine care and repair of this equipment, which includes radars, computers, weapons direction equipment, target designation systems, gyroscopes and rangefinders."
  },
  {
    "title":"Fire Control Technician",
    "branch":"Navy",
    "abbreviation":"FT",
    "type":"Other",
    "description":"Fire Control Technicians maintain the electronic equipment used in submarine weapons systems. They are responsible for the operation and maintenance of the complex electronic, electrical and mechanical equipment required to ensure the accuracy of Navy guided-missile systems and underwater weapons. They are responsible for ship safety by recognizing and analyzing data from several critical systems including sonar, radar, periscope, radio, and torpedo inputs."
  },
  {
    "title":"Gunner's Mate",
    "branch":"Navy",
    "abbreviation":"GM",
    "type":"Other",
    "description":"Gunner's Mates operate and maintain all gunnery equipment, guided-missile launching systems, rocket launchers, guns, turrets, and associated equipment. They repair electrical, electronic, hydraulic and mechanical systems, and make detailed casualty analysis. They test ammunition, missiles and their ordnance components. GMs train and supervise personnel in the handling and stowage of ammunition, missiles, and assigned ordnance equipment."
  },
  {
    "title":"Intelligence Specialist",
    "branch":"Navy",
    "abbreviation":"IS",
    "type":"Other",
    "description":"Intelligence Specialists are involved in collecting and interpreting intelligence especially secret information about enemies or potential enemies. They analyze photographs and prepare charts, maps, and reports that describe in detail the strategic situation all over the world."
  },
  {
    "title":"Information Systems Technician ",
    "branch":"Navy",
    "abbreviation":"IT",
    "type":"Other",
    "description":"Information Systems Technicians design, install, operate, and maintain state-of-the-art informations systems. This technology includes local and wide area networks, mainframe, mini and microcomputer systems and associated peripheral devices. They also write programs to handle the collection, manipulation and distribution of data for a wide variety of applications and requirements. They perform the functions of a computer system analyst, operate telecommunications systems including automated networks and the full spectrum of data links and circuits."
  },
  {
    "title":"Legalman",
    "branch":"Navy",
    "abbreviation":"LN",
    "type":"Other",
    "description":"Legalmen are trained paralegals who assist professionals in the field of law. They work in Navy legal offices, performing administrative and clerical tasks necessary to process claims, conduct court and administrative hearings. They maintain records, documents and legal reference libraries. Legalmen may give advice on tax returns, voter registration procedures, immigration and customs regulations, regulations governing Social Security and veterans' benefits. They perform many duties related to courts-martial and nonjudicial punishment hearings."
  },
  {
    "title":"Logistics Specialist",
    "branch":"Navy",
    "abbreviation":"LS",
    "type":"Other",
    "description":"Logistics Specialists manage inventories and issuance of repair parts/general supplies and specialized supplies (e.g., personal flight gear for naval aircrews or specialized combat equipment for Navy SEALs or Naval Military Construction Battalion \"Seabees\"), as well as distribute mail for naval ships, submarines, aviation squadrons, and shore-based activities. They procure, receive, store and issue material and repair selected components. They utilize financial accounting and database systems to perform inventory and financial management functions. Additionally, they sort and distribute all official and personal mail, manage money order and stamp inventories, and maintain financial and inventory reports."
  },
  {
    "title":"Master-at-Arms",
    "branch":"Navy",
    "abbreviation":"MA",
    "type":"Other",
    "description":"Masters-at-Arms uphold law and order aboard ships, shore stations, control access to naval installations, and deploy overseas with expeditionary forces and squadrons performing Antiterrorism/Force Protection (AT/FP) duties. The basic duty of an MA is to enforce rules and regulations, maintain good order and discipline, and protect life and property. Some other duties include conducting criminal investigations, personal protective services, take part in correctional and rehabilitative programs, Military Working Dog (MWD) handlers, small arms instruction, lethal and non-lethal weapons training, and organize and train sailors assigned to Shore Patrol police duty. Their equivalents in the civilian world are detectives, security guards, and policemen."
  },
  {
    "title":"Mass Communication Specialist",
    "branch":"Navy",
    "abbreviation":"MC",
    "type":"Other",
    "description":"Mass Communication Specialists are public affairs and visual information experts. They present the U.S. Navy story to audiences in the Navy and to the rest of the world through a variety of media. Mass Communication Specialists write and produce print and broadcast journalism, news, and feature stories for military and civilian newspapers, magazines, television and radio broadcast stations. They record still and video photography of military operations, exercises, and other Navy events."
  },
  {
    "title":"Mineman",
    "branch":"Navy",
    "abbreviation":"MN",
    "type":"Other",
    "description":"Minemen test, maintain, and repair mines and their components. They are responsible for assembling, testing, and delivering mines to the planting agent. They maintain minehandling and minelaying equipment.[5] At sea, Minemen primarily man Avenger Class mine countermeasures ships as well the new Independence Class littoral combat ships as a part of the MCM module. Their duties at sea include but are not limited to: operating mine hunting sonar, operating remote controlled submersibles in prosecuting mine-like contacts, rigging and deploying minesweeping gear as well as standing normal underway deck and Combat Information Center watches."
  },
  {
    "title":"Missile Technician",
    "branch":"Navy",
    "abbreviation":"MT",
    "type":"Other",
    "description":"Missile Technicians operate and maintain the UGM-133 Trident II D5 missile Strategic Weapon System (SWS) carried aboard ballistic missile submarines and at Strategic Weapons facilities. Missile Technicians operate and maintain electronic, mechanical, hydraulic and pneumatic Strategic Weapon subsytems, test and operate the MK98 fire-control system and MK 6 guidance system, perform classified targeting operations, and provide physical security to nuclear weapon systems."
  },
  {
    "title":"Musician",
    "branch":"Navy",
    "abbreviation":"MU",
    "type":"Other",
    "description":"Musicians play in official Navy bands and special groups such as jazz bands, dance bands and small ensembles. They give concerts and provide music for military ceremonies, religious services, parades, receptions and dances. Official unit bands usually do not include stringed instruments, but each musician must be able to play at least one brass, woodwind or percussion instrument. Sailors are selected for this rating through auditions."
  },
  {
    "title":"Navy Counselor",
    "branch":"Navy",
    "abbreviation":"NC",
    "type":"Other",
    "description":"Navy Counselors offer vocational guidance to Navy personnel � individually and in groups � aboard ships and at shore facilities. They assess the interests, aptitudes, abilities and personalities of individuals and assist them in reaching their full potential. They are responsible directly to the command triumvirate (CO, XO, CMC) and report on many items such as retention, attrition, advancement, testing and various other facets of the career development program. Additionally, it is their keen eye and attention to detail that ensure personnel throughout the command are updated on current Navy policies in regards to career management, off duty education and administrative procedures, among various other responsibilities."
  },
  {
    "title":"Operations Specialist",
    "branch":"Navy",
    "abbreviation":"OS",
    "type":"Other",
    "description":"Operations Specialists operate radar, navigation and communications equipment in the shipboard combat information centers (CICs) or bridges. They detect and track ships, planes, and missiles. They operate and maintain identification friend or foe (IFF) systems, electronic countermeasures (ECM) equipment and radio-telephones. They control and assist aircraft."
  },
  {
    "title":"Personnel Specialist",
    "branch":"Navy",
    "abbreviation":"PS",
    "type":"Other",
    "description":"Personnel Specialists provide enlisted personnel with information and counseling about Navy jobs, opportunities for general education and training, and promotion requirements. They assist enlisted members' families with legal aid or reassignments in hardship situations. Personnel Specialists keep records up to date, prepare reports, type letters and maintain files."
  },
  {
    "title":"Quartermaster",
    "branch":"Navy",
    "abbreviation":"QM",
    "type":"Other",
    "description":"Quartermasters assist the navigator and officer of the deck (OOD), steer the ship, take radar bearings and ranges, make depth soundings and celestial observations, plot courses and command small craft."
  },
  {
    "title":"Religious Programs Specialist",
    "branch":"Navy",
    "abbreviation":"RP",
    "type":"Other",
    "description":"Religious Programs Specialists assist Navy chaplains with administrative and budgetary tasks. They serve as custodians of chapel funds, keep religious documents and stay in contact with religious and community agencies. They prepare devotional and religious educational materials, set up volunteer programs, operate shipboard libraries, supervise chaplains' offices and perform administrative, clerical and secretarial duties. They train personnel in religious programs and publicize religious activities."
  },
  {
    "title":"Special Warfare Boat Operator",
    "branch":"Navy",
    "abbreviation":"SB",
    "type":"Other",
    "description":"Special Warfare Boat Operators (SWCC - Special Warfare Combatant-Craft Crewmen) drive fast speedboats down narrow, winding rivers, or the open ocean while performing high speed, medium range, or all weather insertion/extraction of Special Operations Forces. They participate in maritime interdiction operations, tactical swimmer operations, intelligence collection, operation deception, and Coastal patrol."
  },
  {
    "title":"Ship's Serviceman",
    "branch":"Navy",
    "abbreviation":"SH",
    "type":"Other",
    "description":"Ship's Servicemen manage barber shops, tailor shops, ships' uniform stores, laundries, dry cleaning plants and cobbler shops. They serve as clerks in exchanges, gas stations, warehouses, and commissary stores. Some ship's servicemen function as Navy club managers."
  },
  {
    "title":"Special Warfare Operator",
    "branch":"Navy",
    "abbreviation":"SO",
    "type":"Other",
    "description":"Special Warfare Operators are Navy SEALs, which are the Navy's primary unconventional warfare units that conduct warfare at SEa, in the Air, and on Land (SEAL). A SEAL's core skills consist of: Sniper, Breacher, Communicator, Maritime/Engineering, Close Air Support, Corpsman, Driver, Navigator (Rural/Urban/Protective Security), Heavy Weapons Operator, Sensitive Site Exploitation, Air Operations (Parachuting/Helicopter Insertion, etc.), Climber, Interrogator, Explosive Ordnance Disposal, Technical Surveillance, and Advanced Special Operations. SEALs oversee ocean-borne mine disposal, carry out direct action raids against military targets, conduct reconnaissance, and secure beachheads for invading amphibious forces."
  },
  {
    "title":"Sonar Technician",
    "branch":"Navy",
    "abbreviation":"ST",
    "type":"Other",
    "description":"Sonar Technicians are responsible for underwater surveillance. They assist in safe navigation and aid in search and rescue and attack operations. They operate and repair sonar equipment and jam enemy sonars. Sonar Technicians operate, maintain and repair sonar systems, antisubmarine warfare fire control equipment and other various equipment associated with underwater detection, counter-detection, warfare and communications."
  },
  {
    "title":"Yeoman",
    "branch":"Navy",
    "abbreviation":"YN",
    "type":"Other",
    "description":"Yeomen perform Administrative and Clerical work. They deal with visitors, coordinate worldwide travel, submit passport applications, telephone calls and incoming mail, and assist various ships, squadrons, staff commands, and special warfare teams around the world with administrative tasks. They write and type business and social letters, notices, directives, forms and reports."
  },
  {
    "title":"Damage Controlman",
    "branch":"Navy",
    "abbreviation":"DC",
    "type":"Engineering",
    "description":"Damage Controlmen perform the work necessary for damage control, ship stability, fire-fighting. They also prepare defenses against chemical, biological and radiological (CBR) warfare attacks. They instruct personnel in damage control and CBR defense and repair damage-control equipment and systems."
  },
  {
    "title":"Electrician's Mate",
    "branch":"Navy",
    "abbreviation":"EM",
    "type":"Engineering",
    "description":"Electrician's Mates are responsible for the operation and repair of a ship's or station's electrical power plant and electrical equipment. They also maintain and repair power and lighting circuits, distribution switchboards, generators, motors and other electrical equipment. Specially qualified Electrician's Mates are employed onboard nuclear-powered ships to maintain the control subsystems in nuclear reactors."
  },
  {
    "title":"Engineman",
    "branch":"Navy",
    "abbreviation":"EN",
    "type":"Engineering",
    "description":"Enginemen are responsible for internal diesel and gasoline engines. They also maintain refrigeration, air-conditioning, distilling-plant engines and compressors."
  },
  {
    "title":"Gas Turbine System Technician",
    "branch":"Navy",
    "abbreviation":"GS",
    "type":"Engineering",
    "description":"Gas Turbine System Technician are responsible for all gas turbine engines. They maintain propulsion machinery, including gears, shafting and controllable pitch propellers, assigned auxiliary equipment propulsion control systems, electrical and electronic circuitry up to the printed circuit module, and alarm and warning circuitry. They handle administrative tasks related to gas turbine propulsion system operation and maintenance."
  },
  {
    "title":"Hull Maintenance Technician",
    "branch":"Navy",
    "abbreviation":"HT",
    "type":"Engineering",
    "description":"Hull Maintenance Technicians are responsible for maintaining ships' hulls, fittings, piping systems and machinery. They install and maintain all shipboard and shore based plumbing and piping systems. They look after a vessel's safety and survival equipment and perform many tasks related to damage control."
  },
  {
    "title":"Interior Communications Electrician",
    "branch":"Navy",
    "abbreviation":"IC",
    "type":"Engineering",
    "description":"Interior Communications Electricians operate and repair electronic devices used in the ship's interior communications systems, SITE TV systems, 1MC (public address system), electronic megaphones and other announcing equipment. They are responsible for the gyrocompass systems."
  },
  {
    "title":"Machinist's Mate",
    "branch":"Navy",
    "abbreviation":"MM",
    "type":"Engineering",
    "description":"Machinist's Mates are responsible for the continuous operation of the many engines, compressors, gears, refrigeration, and air-conditioning equipment along with other types of machinery onboard ships and shore installations. They are responsible for the ship's steam propulsion and auxiliary equipment and the outside (deck) machinery. Specially trained and qualified Machinist's Mates are deployed onboard nuclear-powered ships to maintain the machinery and piping in nuclear reactors.Some nuclear machinists mates (Engineering Laboratory Technicians) receive additional specialization in Health Physics and maintaining reactor chemistry. "
  },
  {
    "title":"Machinery Repairman",
    "branch":"Navy",
    "abbreviation":"MR",
    "type":"Engineering",
    "description":"Machinery Repairmen are skilled machine tool operators. They make replacement parts and repair or overhaul a ship's engine auxiliary equipment, such as evaporators, air compressors and pumps. They repair deck equipment, including winches, hoists, condensers, and heat exchange devices. Shipboard Machinery Repairmen frequently operate main propulsion machinery, besides performing machine shop and repair duties."
  },
  {
    "title":"Navy Diver",
    "branch":"Navy",
    "abbreviation":"ND",
    "type":"Engineering",
    "description":"Navy Divers are responsible for a wide variety of tasks like underwater ship maintenance, construction, explosive ordnance disposal (EOD), and underwater rescue. They are assigned to Naval Special Warfare Units to provide diving technical expertise and supervisory support to all submersible operations."
  }
]